In [5]:
import pandas as pd

In [9]:
Filepath ="Data_Files/Data.xlsx"

In [11]:
df = pd.read_excel(Filepath)

In [13]:
df

       name  age   department  salary
0     Alice   30           HR   50000
1       Bob   24  Engineering   60000
2   Charlie   26        Sales   55000
3     David   35  Engineering   80000
4       Eve   29           HR   52000
5     Frank   27        Sales   58000
6     Grace   31  Engineering   70000
7    Hannah   23        Sales   53000
8       Ian   34           HR   51000
9      Jack   28  Engineering   62000
10      Eve   29           HR   52000

In [21]:
grouped=df.groupby("department")["age"]
grouped

In [27]:
df.groupby("department").agg({"salary":["sum","mean","max","min","median","std","var"]})

             salary                                                    \
                sum          mean    max    min   median          std
department
Engineering  272000  68000.000000  80000  60000  66000.0  9092.121131
HR           205000  51250.000000  52000  50000  51500.0   957.427108
Sales        166000  55333.333333  58000  53000  55000.0  2516.611478


                      var
department
Engineering  8.266667e+07
HR           9.166667e+05
Sales        6.333333e+06